Revit 2027 API
SlantedOrVerticalColumnType Enumeration
 This enum class is used for the BuiltInParameter SLANTED_COLUMN_TYPE_PARAM.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum SlantedOrVerticalColumnType
Public Enumeration SlantedOrVerticalColumnType
public enum class SlantedOrVerticalColumnType
type SlantedOrVerticalColumnType
Members
Member name | Value | Description
CT_Angle | 1
CT_EndPoint | 2
CT_Vertical | 0
See Also
Reference
Autodesk.Revit.DB Namespace